# Index in Pandas

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("CRO.csv")

In [3]:
data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [4]:
data.columns

Index(['country', 'age', 'new_user', 'source', 'total_pages_visited',
       'converted'],
      dtype='object')

In [7]:
data.index

RangeIndex(start=0, stop=316200, step=1)

In [8]:
data.shape

(316200, 6)

In [9]:
data.set_index('country',inplace=True)

In [11]:
data.head()

         age  new_user source  total_pages_visited  converted
country
UK        25         1    Ads                    1          0
US        23         1    Seo                    5          0
US        28         1    Seo                    4          0
China     39         1    Seo                    5          0
US        30         1    Seo                    6          0

In [12]:
data.index

Index(['UK', 'US', 'US', 'China', 'US', 'US', 'China', 'US', 'UK', 'US',
       ...
       'US', 'US', 'China', 'UK', 'UK', 'US', 'US', 'China', 'US', 'UK'],
      dtype='object', name='country', length=316200)

In [13]:
data.columns

Index(['age', 'new_user', 'source', 'total_pages_visited', 'converted'], dtype='object')

In [14]:
data.shape

(316200, 5)

In [16]:
data.loc["US","new_user"].head()

country
US    1
US    1
US    1
US    0
US    0
Name: new_user, dtype: int64

In [17]:
data.index.name=None

In [18]:
data.head()

       age  new_user source  total_pages_visited  converted
UK      25         1    Ads                    1          0
US      23         1    Seo                    5          0
US      28         1    Seo                    4          0
China   39         1    Seo                    5          0
US      30         1    Seo                    6          0

In [19]:
data.index.name="Nation"

In [20]:
data.head()

        age  new_user source  total_pages_visited  converted
Nation
UK       25         1    Ads                    1          0
US       23         1    Seo                    5          0
US       28         1    Seo                    4          0
China    39         1    Seo                    5          0
US       30         1    Seo                    6          0

In [21]:
data.describe()

                 age       new_user  total_pages_visited      converted
count  316200.000000  316200.000000        316200.000000  316200.000000
mean       30.569858       0.685465             4.872966       0.032258
std         8.271802       0.464331             3.341104       0.176685
min        17.000000       0.000000             1.000000       0.000000
25%        24.000000       0.000000             2.000000       0.000000
50%        30.000000       1.000000             4.000000       0.000000
75%        36.000000       1.000000             7.000000       0.000000
max       123.000000       1.000000            29.000000       1.000000

In [22]:
data.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [23]:
data.describe().columns

Index(['age', 'new_user', 'total_pages_visited', 'converted'], dtype='object')

# loc,iloc,ix

In [24]:
data.head()

        age  new_user source  total_pages_visited  converted
Nation
UK       25         1    Ads                    1          0
US       23         1    Seo                    5          0
US       28         1    Seo                    4          0
China    39         1    Seo                    5          0
US       30         1    Seo                    6          0

In [45]:
data.drop(["level_0","index"],inplace=True,axis=1)

In [46]:
data.head()

  Nation  age  new_user source  total_pages_visited  converted
0     UK   25         1    Ads                    1          0
1     US   23         1    Seo                    5          0
2     US   28         1    Seo                    4          0
3  China   39         1    Seo                    5          0
4     US   30         1    Seo                    6          0

In [47]:
data.loc[0,:]

Nation                  UK
age                     25
new_user                 1
source                 Ads
total_pages_visited      1
converted                0
Name: 0, dtype: object

In [49]:
data.loc[[0,1,2],:]

  Nation  age  new_user source  total_pages_visited  converted
0     UK   25         1    Ads                    1          0
1     US   23         1    Seo                    5          0
2     US   28         1    Seo                    4          0

In [50]:
data.loc[0:2,:]

  Nation  age  new_user source  total_pages_visited  converted
0     UK   25         1    Ads                    1          0
1     US   23         1    Seo                    5          0
2     US   28         1    Seo                    4          0

In [59]:
data.ix[0,"Nation"]

'UK'

In [ ]:
#loc--> used with names 
#iloc-->used with position
#ix---> used with both position and names